public class control_ex {
    public static void main(String[] args) {
        // ex1: 黄金分割
        //寻找某两个数相除，其结果 离黄金分割点 0.618最近
        //
        //分母和分子不能同时为偶数
        //分母和分子 取值范围在[1-20]



        // ex2: 水仙花数
        // 水仙花数定义：
        //1. 一定是3位数
        //2. 每一位的立方，加起来恰好是这个数本身，比如153=1*1*1+5*5*5+3*3*3
        //
        //寻找所有的水仙花数



        // ex3: 小学算术题
        /**
         * 一个数字小迷阵,使用程序暴力破解求出ABCD各数的值
         *
         * | A  | + | B | = | 8 |
         * | +  |   | + |   |   |
         * | C  | - | D | = | 6 |
         * | =  |   | = |   |   |
         * | 14 |   | 50|   |   |
         *
         * @author yangchaofu
         *
         */


    }
}
